{
  "welcome_back" : "Добро пожаловать",
  "choose_app_lang": "Выберите язык приложения",
  "Home" : "Дом",
  "Education": "Образование",
  "Reminder": "Уведомление",
  "Settings": "Настройки",
  "Ready to Update!" : "Готов к обновлению!",
  "An exciting new version of the app is available. Update now to enjoy the latest features and improvements!" : "Доступна интересная новая версия приложения. Обновите версию прямо сейчас, чтобы насладиться новейшими функциями и улучшениями!",
  "Update Now": "Обновить сейчас",
  "Premium": "Премиум",
  "Sorry base is empty": "Извините, база пуста 😔",
  "Purchase": "Покупка",
  "Something went wrong": "Что-то пошло не так",
  "Wrong": "Неправильный",
  "You dont have enough coins for this movie!": "У вас недостаточно монет для этого фильма!",
  "Cancel": "Отмена",
  "Forcoins" : "Для {} монет",
  "Search": "Поиск",
  "About": "О нас",
  "Welcome to BrainBox": "Добро пожаловать в BrainBox",
  "Your Gateway to Language Mastery Through the Magic of Movies!": "Ваш путь к владению языком через магию кино!",
  "Our Mission:": "Наша миссия:",
  "At BrainBox, we believe that language learning should be engaging, effective, and fun. Our unique approach to language acquisition harnesses the power of movie subtitles to immerse you in a world where learning meets entertainment.": "В BrainBox мы считаем, что изучение языка должно быть увлекательным, эффективным и веселым. Наш уникальный подход к изучению языка использует силу субтитров к фильмам, чтобы погрузить вас в мир, где обучение сочетается с развлечением.",
  "How It Works:": "Как это работает:",
  "1. Choose Your Movie: Dive into our extensive library of films and select your favorite. Whether it's a Hollywood blockbuster or a foreign indie gem, our collection is tailored to cater to all tastes and learning levels.": "1. Выберите свой фильм: Погрузитесь в нашу обширную коллекцию фильмов и выберите свой любимый. Будь то голливудский блокбастер или зарубежный инди-шедевр, наша коллекция подходит для всех вкусов и уровней обучения.",
  "2. Pick Your Language: Select the language you want to learn. From Spanish to Mandarin, French to Japanese, we offer a wide range of languages.": "2. Выберите свой язык: Выберите язык, который хотите изучать. От испанского до мандаринского, от французского до японского, мы предлагаем широкий выбор языков.",
  "3. Learn with Subtitles: As you watch, our intuitive app displays subtitles in both your native language and the language you're learning. This dual-subtitle system ensures comprehension while challenging you to expand your vocabulary.": "3. Учите с субтитрами: Пока вы смотрите, наше интуитивно понятное приложение отображает субтитры как на вашем родном языке, так и на изучаемом вами языке. Эта система двойных субтитров обеспечивает понимание, одновременно стимулируя вас к расширению словарного запаса.",
  "4. Interactive Learning Tools: Engage with interactive quizzes, flashcards, and vocabulary lists generated from the movie's dialogue. Test your knowledge and track your progress after each film.": "4. Интерактивные инструменты обучения: Используйте интерактивные викторины, карточки и списки слов, созданные на основе диалогов фильма. Проверьте свои знания и отслеживайте свой прогресс после каждого фильма.",
  "5. Customized Learning Experience: Set your own pace and choose specific topics or words you want to focus on. Our app adapts to your learning style, making every movie-watching experience a step towards language proficiency.": "5. Индивидуальный опыт обучения: Задайте свой собственный темп и выберите конкретные темы или слова, на которые вы хотите сосредоточиться. Наше приложение адаптируется к вашему стилю обучения, делая каждый просмотр фильма шагом к владению языком.",
  "Why Movies?": "Почему фильмы?",
  "Movies are not just about entertainment; they are cultural snapshots. They provide contextual learning, making it easier to understand idiomatic expressions, slang, and the natural flow of conversation. By learning through movies, you're not just memorizing words; you're experiencing the language as it's spoken by natives in real-life situations.": "Фильмы - это не только развлечение; это культурные моменты. Они обеспечивают контекстное обучение, упрощая понимание идиоматических выражений, сленга и естественного потока разговора. Учась на фильмах, вы не просто запоминаете слова; вы испытываете язык так, как он говорится носителями в реальных жизненных ситуациях.",
  "Safe and Secure:": "Безопасно и надежно:",
  "Your privacy and online safety are paramount. BrainBox is committed to protecting your data and providing a secure learning environment.": "Ваша конфиденциальность и онлайн-безопасность имеют первостепенное значение. BrainBox стремится защитить ваши данные и обеспечить безопасную среду обучения.",
  "Join Our Community:": "Присоединяйтесь к нашему сообществу:",
  "Become part of a global community of language enthusiasts. Share insights, discuss movies, and practice your new language skills with learners from around the world.": "Станьте частью глобального сообщества энтузиастов языков. Делитесь взглядами, обсуждайте фильмы и практикуйте свои новые языковые навыки с учащимися со всего мира.",
  "Brainbox": "Brainbox",
  "Language": "Язык",
  "Night mode": "Ночной режим",
  "App sound": "Звук приложения",
  "Permission is denied": "Доступ запрещен",
  "Go settings": "Перейти в настройки",
  "Something went wrong !": "Что-то пошло не так!",
  "Saved words": "Сохраненные слова",
  "Help": "Помощь",
  "Rate the app": "Оцените приложение",
  "Photo": "Фото",
  "Music": "Музыка",
  "Video": "Видео",
  "Share": "Поделиться",
  "Name": "Имя",
  "Email": "Электронная почта",
  "Coins": "Монеты",
  "Add Coins": "Добавить монеты",
  "Help & Support": "Помощь и поддержка",
  "Frequently Asked Questions": "Часто задаваемые вопросы",
  "How do I start learning a new language?": "Как начать изучать новый язык?",
  "To start learning a new language, first select the language you are interested in from our language list, then choose a movie to watch with dual subtitles.": "Чтобы начать изучать новый язык, сначала выберите интересующий вас язык из нашего списка языков, затем выберите фильм для просмотра с двойными субтитрами.",
  "Can I track my learning progress?": "Могу ли я отслеживать свой учебный прогресс?",
  "Yes, your progress is tracked automatically as you watch movies and complete interactive exercises.": "Да, ваш прогресс автоматически отслеживается, когда вы смотрите фильмы и выполняете интерактивные упражнения.",
  "Need More Help?": "Нужна дополнительная помощь?",
  "If you have more questions or need further assistance, feel free to contact our support team at aladdinsgroup.uz@gmail.com.": "Если у вас есть дополнительные вопросы или вам нужна дальнейшая помощь, не стесняйтесь обращаться в нашу службу поддержки по адресу aladdinsgroup.uz@gmail.com.",
  "Notification time": "Время уведомления",
  "Select per minute": "Выбрать периодичность в минутах",
  "Please enter every minute !": "Пожалуйста, введите интервал в минутах!",
  "Yes": "Да",
  "Please try again !": "Пожалуйста, попробуйте снова!",
  "Success !": "Успешно!",
  "Field is empty !": "Поле пустое!",
  "Get reminder from saved words": "Получать напоминания из сохраненных слов",
  "Write some word": "Напишите слово",
  "Word": "Слово",
  "Translate": "Перевод",
  "Save": "Сохранить",
  "Add some words for memorize!": "Добавьте слова для запоминания!",
  "When you add some word, app will send reminder you!": "Когда вы добавляете слова, приложение будет напоминать вам о них!",
  "Notification is not allowed !": "Уведомления запрещены!",
  "Press Allow notification button and select Notifications and switch allow.": "Нажмите кнопку 'Разрешить уведомления', выберите 'Уведомления' и включите их.",
  "Allow notification": "Разрешить уведомления",


  "appTitle": "Магазин",
  "coins500": "500 монет за 0.99$",
  "coins5000": "5000 монет за 4.99$",
  "premiumYear": "Премиум на год за 9.99$",
  "watchVideo": "Посмотреть видео и получить 30 монет",
  "pending": "В ожидании...",
  "payingError": "Ошибка оплаты",
  "failure": "Ошибка",
  "getCoinsForWatching": "Получите 30 монет за просмотр",
  "onAdFailedToShowFullScreenContent": "Ошибка при отображении рекламы",
  "youEarned": "Вы заработали {}",
  "rewardAmount": "{{amount}}",
  "rewardedAdNotLoaded": "Реклама еще не загружена",
  "Sign with Google": "Войти через Google",
  "Pay with telegram bot" : "Оплата с Telegram-бота",
  "Logout": "Выйти"
}