{
  "welcome_back": "Xush kelibsiz",
  "choose_app_lang": "Ilova tilini tanlang",
  "Home": "Bosh sahifa",
  "Education": "Ta'lim",
  "Reminder": "Eslatma",
  "Settings": "Sozlamalar",
  "Ready to Update!": "Yangilashga tayyor!",
  "An exciting new version of the app is available. Update now to enjoy the latest features and improvements!": "Ilovaning yangi versiyasi mavjud. Eng so'nggi imkoniyatlardan bahramand bo'lish uchun hozir yangilang!",
  "Update Now": "Hozir Yangilang",
  "Premium": "Premium",
  "Sorry base is empty": "Uzr, ma'lumotlar bazasi bo'sh 😔",
  "Purchase": "Sotib olish",
  "Something went wrong": "Nimadir noto'g'ri bo'ldi",
  "Wrong": "Noto'g'ri",
  "You don't have enough coins for this movie!": "Sizda bu film uchun yetarli tangalar yo'q!",
  "Cancel": "Bekor qilish",
  "Forcoins": "{} tangalar uchun",
  "Search": "Qidiruv",
  "Request movie": "Film so'rash",
  "Not find,but you can order the movie": "Topilmadi 😔, lekin siz film buyurtma qilishingiz mumkin 😃",
  "Sent your order": "Buyurtmangiz yuborildi 😉",
  "Translate": "Tarjima qilish",
  "Word": "So'z",
  "Write some word": "Ba'zi so'zlar yozing",
  "Get reminder from saved words": "Saqlangan so'zlardan eslatma oling",
  "Field is empty !": "Maydon bo'sh!",
  "Success !": "Muvaffaqiyat !",
  "Please try again !": "Iltimos, yana bir bor urinib ko'ring {}!",
  "Yes": "Ha",
  "Please enter every minute !": "Iltimos, har daqiqada kiriting!",
  "Select per minute": "Daqiqasiga tanlang",
  "Notification time": "Bildirishnoma vaqti",
  "Save": "Saqlash",
  "Add some words for memorize!": "📜 Esda saqlash uchun ba'zi so'zlarni qo'shing!",
  "When you add some word, app will send reminder you!": "Siz ba'zi so'z qo'shganda, ilova sizga eslatma yuboradi!",
  "Notification is not allowed !": "😔 Bildirishnomalarga ruxsat berilmagan!",
  "Press Allow notification button and select Notifications and swtich allow.": "\"Bildirishnomalarga ruxsat berish\" tugmasini bosing va Bildirishnomalarni tanlang va ruxsatni yoqing.",
  "Allow notification": "Bildirishnomalarga ruxsat berish",
  "Language": "Til",
  "Night mode": "Tungi rejim",
  "App sound": "Ilova ovozi",
  "Permission is denied": "Ruxsat rad etildi",
  "Go settings": "Sozlamalarga o'tish",
  "Saved words": "Saqlangan so'zlar",
  "Help": "Yordam",
  "About": "Haqida",
  "Rate the app": "Ilovani baholang",
  "Help & Support": "Yordam va Qo'llab-quvvatlash",
  "Frequently Asked Questions": "Tez-tez so'raladigan savollar",
  "Need More Help?": "Ko'proq yordam kerakmi?",
  "If you have more questions or need further assistance, feel free to contact our support team at aladdinsgroup.uz@gmail.com.": "Agar sizda ko'proq savollar bo'lsa yoki qo'shimcha yordam kerak bo'lsa, aladdinsgroup.uz@gmail.com manzilida bizning qo'llab-quvvatlash jamoamizga murojaat qilishingizdan mamnunmiz.",
  "Welcome to BrainBox": "BrainBox'ga xush kelibsiz",
  "Your Gateway to Language Mastery Through the Magic of Movies!": "Filmlar sehri orqali til o'rganishga o'zingizning yo'lingiz!",
  "Our Mission:": "Bizning Vazifamiz:",
  "At BrainBox, we believe that language learning should be engaging, effective, and fun. Our unique approach to language acquisition harnesses the power of movie subtitles to immerse you in a world where learning meets entertainment.": "BrainBox'da biz til o'rganishning qiziqarli, samarali va zavqli bo'lishiga ishonamiz. Tilni o'rganishdagi noyob yondashuvimiz sizni o'rganish va ko'ngilocharlik uchrashadigan dunyoga sho'ng'itish uchun film subtitrlarining kuchidan foydalanadi.",
  "How It Works:": "Bu Qanday Ishlaydi:",
  "1. Choose Your Movie: Dive into our extensive library of films and select your favorite. Whether it's a Hollywood blockbuster or a foreign indie gem, our collection is tailored to cater to all tastes and learning levels.": "1. Filmingizni Tanlang: Keng ko'lamli film kutubxonamizga sho'ng'ing va sevimli filmingizni tanlang. Bu Gollivud blokbasteri yoki xorijiy mustaqil tosh bo'ladimi, bizning to'plamimiz barcha ta'mlarga va o'rganish darajalariga moslashtirilgan.",
  "2. Pick Your Language: Select the language you want to learn. From Spanish to Mandarin, French to Japanese, we offer a wide range of languages.": "2. Tilni Tanlang: O'rganmoqchi bo'lgan tilingizni tanlang. Ispaniyadan mandaringa, fransuzdan yaponiyagacha, biz keng ko'lamli tillarni taklif etamiz.",
  "3. Learn with Subtitles: As you watch, our intuitive app displays subtitles in both your native language and the language you're learning. This dual-subtitle system ensures comprehension while challenging you to expand your vocabulary.": "3. Subtitrlar bilan O'rganing: Siz tomosha qilayotganda, bizning intuitiv ilovamiz sizning ona tilingizda ham, o'rganayotgan tilingizda ham subtitrlarni ko'rsatadi. Bu ikki tomonlama subtitr tizimi tushunishni ta'minlaydi va sizni so'z boyligingizni kengaytirishga undaydi.",
  "4. Interactive Learning Tools: Engage with interactive quizzes, flashcards, and vocabulary lists generated from the movie's dialogue. Test your knowledge and track your progress after each film.": "4. Interaktiv O'quv Vositalari: Filmdagi dialoglardan yaratilgan interaktiv viktorinalar, flesh-kartalar va so'zlar ro'yxati bilan ishtirok eting. Bilimingizni sinab ko'ring va har bir film keyin o'z rivojlanishingizni kuzatib boring.",
  "5. Customized Learning Experience: Set your own pace and choose specific topics or words you want to focus on. Our app adapts to your learning style, making every movie-watching experience a step towards language proficiency.": "5. Maxsuslashtirilgan O'quv Tajribasi: O'zingizning o'rganish tezligingizni belgilang va diqqat qaratmoqchi bo'lgan aniq mavzularni yoki so'zlarni tanlang. Bizning ilovamiz sizning o'rganish uslubingizga moslashadi, bu esa har bir film tomosha qilish tajribasini til mahoratiga qadam qo'yishga aylantiradi.",
  "Why Movies?": "Nega Filmlar?",
  "Movies are not just about entertainment; they are cultural snapshots. They provide contextual learning, making it easier to understand idiomatic expressions, slang, and the natural flow of conversation. By learning through movies, you're not just memorizing words; you're experiencing the language as it's spoken by natives in real-life situations.": "Filmlar faqat o'yin-kulgi haqida emas; ular madaniy lahzalardir. Ular kontekstli o'rganishni ta'minlaydi, bu idiomatik iboralarni, jargonlarni va suhbatning tabiiy oqimini tushunishni osonlashtiradi. Filmlar orqali o'rganish orqali siz shunchaki so'zlarni eslab qolmaysiz; Siz haqiqiy hayotda mahalliy aholi gapiradigan tilni boshdan kechirmoqdasiz.",
  "Safe and Secure:": "Xavfsiz va xavfsiz:",
  "Your privacy and online safety are paramount. BrainBox is committed to protecting your data and providing a secure learning environment.": "Maxfiyligingiz va onlayn xavfsizligingiz muhim. BrainBox ma'lumotlaringizni himoya qilish va xavfsiz o'quv muhitini ta'minlashga intiladi.",
  "Join Our Community:": "Join Our Community:",
  "Become part of a global community of language enthusiasts. Share insights, discuss movies, and practice your new language skills with learners from around the world.": "Til ishqibozlarining global hamjamiyatiga a'zo bo'ling. Dunyo boʻylab oʻquvchilar bilan tushunchalarni baham koʻring, filmlarni muhokama qiling va yangi til koʻnikmalaringizni mashq qiling.",
  "How do I start learning a new language?": "Yangi tilni o'rganishni qanday boshlashim kerak?",
  "To start learning a new language, first select the language you are interested in from our language list, then choose a movie to watch with dual subtitles.": "Yangi tilni oʻrganishni boshlash uchun avval tillar roʻyxatidan oʻzingizni qiziqtirgan tilni tanlang, soʻngra ikki tomonlama subtitrli tomosha qilish uchun filmni tanlang.",
  "Can I track my learning progress?": "O'qishdagi muvaffaqiyatimni kuzata olamanmi?",
  "Yes, your progress is tracked automatically as you watch movies and complete interactive exercises.": "Ha, filmlarni tomosha qilganingizda va interaktiv mashqlarni bajarganingizda muvaffaqiyatingiz avtomatik ravishda kuzatiladi.",
  "Sign with Google": "Google bilan tizimga kiring",
  "Pay with telegram bot" : "Telegram bot bilan to'lash",
  "failure": "Xato",
  "appTitle": "Brain Box",
  "coins500": "500 Tangalar",
  "coins5000": "5000 Tangalar",
  "premiumYear": "Bir Yilga Premium",
  "getCoinsForWatching": "Reklamalarni Ko'rib Tangalar Ol",
  "watchVideo": "Videoni Ko'ring",
  "payWithTelegramBot": "Telegram Bot Orqali To'lov",
  "pending": "Kutilmoqda",
  "payingError": "To'lovda Xatolik",
  "youEarned": "Siz {reward} Tanga Topdingiz",
  "rewardedAdNotLoaded": "Mukofotli Reklama Yuklanmadi",
  "Logout": "Chiqish"
}